[
    {
        "doorType": 4,
        "title":"Beginnings",
        "shorttitle":"1",
        "contentmain":"You wake up in your bed, an alarm blaring in your ears. Turning around to your right side, you partly open your eyes to read the digital clock on your desk. Barely 4 hours of sleep. If that idiot Garrett incorrectly handled the mechanism for the outside lock again, he will be assigned an extra shift to make up for all the lost hours of sleep for sure. After all, you’re the captain of this mission, and you get to assign your crew’s shifts. Quickly, you get up and walk to the sink, and as you splash a bit of water on your face, the alarm stops momentarily, only to pick up after a second or so of silence. A female voice coming from the speakers in your cabin says with a very calm tone “Self-destruction sequence initiated. Please evacuate to the IVS capsules or the surface rover at your earliest convenience. You have - 30 - minutes to evacuate."
    },
    {
        "doorType": 2,
        "title":"Wake up call",
        "shorttitle":"2",
        "contentmain":"Shit. Who the hell initiated self-destruction?! Okay, think quick. The protocol has to have been initiated in the control room, so it will have to be turned off there. But wait, what if it was not triggered by mistake? That question will certainly be answered on your way to the control room by one of your four crew members. You change as quickly as you can into your station clothes, grab some essential equipment, and move to the door of your cabin.", 
        "image":"item2.png",
        "image_width":"30%"
    },
    {
        "doorType": 4,
        "title":"Slimy business",
        "shorttitle":"3",
        "contentmain":"As soon as your door to the main hallway is opened, you can smell it even before you see it: There is a slimy, sticky green substance almost completely covering the floor. You place a handkerchief in front of your nose, but with limited success in keeping unwelcomed smells out. The slime makes it extremely hard to move around in the hallway, and as your boots are getting more and more held back by lumps of green substance, you make a hard decision: a small detour to the Shower Room, just a couple of doors down the hallway, and you might get the cleaning device to get rid of this mess. You hope it will make it quicker for you to get to the control room and deactivate the self-destruction sequence. Moving closer to the Shower Room makes you think, why is this happening now? You just recently solved this issue, it was an outside fungus that entered the station through the vents. But you and your crew closed up that hole a week ago. Uncertain, you stand in front of the Shower Room and pull the handle."
    },
    {
        "doorType": 1,
        "title":"Cleaning duty",
        "shorttitle":"4",
        "contentmain":"The door to the Shower Room opens up, and you step inside. The cleaner is right next to the door in a narrow cupboard, you open it as quickly as you can and get the device out of the charging station. Should be enough to get you through the mess in the hallway.", 
        "roll":"Perception ability check", 
        "contentadditional1":"You take a quick glance around the room, but you notice nothing out of the ordinary. The light is turned off, so you don’t expect any of your crew there. Without looking back, you head into the hallway.",
        "contentadditional2":"While you grab the cleaner, you notice a couple of dark red spots on one of the shower cubicle walls. Taking a quick look around, you don’t notice anything else out of the ordinary. Might be Monica having a nosebleed again. Without looking back, you head into the hallway.",
        "contentadditional3":"While you grab the cleaner, you notice a couple of dark red spots on one of the shower cubicle walls. You push back the shower curtain and sure enough, there is a puddle of dark red liquid on the floor, and yes, it seems to be blood. This doesn’t look good, you need to get to your crew mates quickly. Without looking back, you head into the hallway.",
        "contentadditional4":"While you grab the cleaner, you notice a couple of dark red spots on one of the shower cubicle walls. You push back the shower curtain and sure enough, there is a puddle of dark red liquid on the floor, and yes, it seems to be blood. Suddenly, you get an overwhelming feeling of nausea. You remember, as if you saw pictures, how you were vomiting blood in the bathtub yesterday evening. Disturbed by this sudden flashback, you head into the hallway."
    },
    {
        "doorType": 2,
        "title":"The east wing",
        "shorttitle":"5",
        "contentmain":"You get to the cleaning. Not having much time, you start by pushing the substance out of the way and try making a clear route down the hallway. Josey’s room is the closest one, it’s right at the beginning of the east wing, so you decide to first make your way there. You’ll have to pass the section door. Maybe you’re in luck and the fungus didn’t spread further than your section. You’re about to find out, as you turn left you see the big door connecting the main building to the east wing with the laboratory. As you are about to hold your hand to the finger print scanner, you notice an object trapped beneath another lump of green slime. It’s your raygun, the beretta. How did that one get there?", 
        "image":"item3.png",
        "image_width":"50%"
    },
    {
        "doorType": 1,
        "title":"Beretta 21A",
        "shorttitle":"6",
        "contentmain":"Carefully, you pry the gun out from under the sticky green lump. Disgusting. Simply disgusting. Holding the gun in your hand your first thought is how in the world it possibly got there. It was his personal gun, custom built to fit perfectly in his hands and most importantly, not usable if you didn’t have the exact chip you have implanted into your skin last year.", 
        "roll":"Wisdom ability check", 
        "contentadditional1":"As you start thinking where you put the gun last time you held it, the alarm blares again: “You have - 20 - minutes to evacuate”. Right. No need to overthink this. Holster the gun, find Josey. You step through the door and enter the east wing.",
        "contentadditional2":"This might just be a strange coincidence. Might have fallen out of some pocket. Or not. Hard to say. You decide to stay alert for more strange coincidences, as you step through the door and enter the east wing.",
        "contentadditional3":"You remember running down the hallway yesterday evening. Your memories are foggy, as if it was a dream, but you have a distinct memory of your steps echoing down this exact hallway. And you were sweating profusely. Something went wrong, and you lost your gun. Weird how you don’t really remember what happened before and after though. In any case, you have to move forward, you think as you step through the door and enter the east wing.",
        "contentadditional4":"You remember running down the hallway yesterday evening. Your memories are foggy, as if it was a dream, but you have a distinct memory of your steps echoing down this exact hallway. And you were sweating profusely. Something went wrong, and you decided to drop your gun, which is something you would hardly do in normal circumstances. In any case, you have to move forward, you think as you step through the door and enter the east wing."
    },
    {
        "doorType": 4,
        "title":"Priorities",
        "shorttitle":"7",
        "contentmain":"Fortunately, the fungus didn’t reach the east wing yet, so your way is clear. The door to your left is open, it’s josey’s bedroom. A quick glance into the room makes you realize it was left disheveled, clothes on the floor and several drawers left open.  No sign of Josey however. Of course, after all it’s her. No way Josey would leave without getting as many of her test results as possible. You’ll have to drag her out of that damn laboratory you realize as you walk towards the large door at the end of the corridor."
    },
    {
        "doorType": 3,
        "title":"Josey",
        "shorttitle":"8",
        "contentmain":"You open the laboratory door and find Josey standing over a large pile of documents, as she is stuffing another pile of documents into a backpack. She turns around abruptly as you approach her, placing your hand softly on her shoulder you say “Josey, what are doing? We have to get out of here or deactivate the self-destruction sequence. Either way, there is no time for this right now, we need to get going.”. She sighs, grabs the backpack next to her and says “What’s the plan captain?”",
        "image":"doctor.png",
        "contentadditionalTake":"“Come with me, we’re heading to the control room.” Josey nods and straps the backpack on. “Lead the way” she says, as you both turn to leave the laboratory.",
        "contentadditionalLeave":"“Looks like you already got enough documents for years of further research. You need to evacuate, get to the IVS capsules and save yourself.” Josey nods, and you can see a bit of hesitance in her eyes. But still, she straps the backpack on and simply says “Got it. Will do. See you back at the main ship.”. As she steps out of the laboratory door, she stops and says “Good luck, captain”, before quickly vanishing into the corridor."
    },
    {
        "doorType": 1,
        "title":"Scars and stitches",
        "shorttitle":"9",
        "contentmain":"Just as you were about to leave the laboratory, you notice a bunch of dirty surgical instruments strewn chaotically on a small table. Josey didn’t say anything about them, she seemingly didn’t notice.", 
        "roll":"Investigation ability check", 
        "contentadditional1":"The dirt on the instruments is dried already. Must have been a small thing and Josey forgot to clean up afterwards. Happens. You certainly have more pressing things to worry about now. You continue back to the main section of the building.",
        "contentadditional2":"From the type of instruments lying on the table, it seems as if somebody was trying to stich something up, like closing up a wound. Anyway, no time to worry about these things. You continue back to the main section of the building.",
        "contentadditional3":"From the type of instruments lying on the table, it seems as if somebody was trying to stich something up, like closing up a wound. Probably used for something like a larger scratch or a bigger tear in the skin. Seems like whoever used it just didn’t clean up properly behind themselves. Someone must have been in a hurry, and it surely wasn’t Josey, she would always put her things in the proper place. Still, continuing back to the main section of the building seems like the best option now, so you move ahead.",
        "contentadditional4":"From the type of instruments lying on the table, it seems as if somebody was trying to stich something up, like closing up a wound. Suddenly, you notice a pull in your lower belly. Carefully, you lift your shirt and sure enough, you see a horizontal wound that is nicely stitched up. Another memory lifts itself from your foggy mental reservoir. You stitched it up yourself, last night, in this room. How did this even happen? You’re unsure, but you decide to continue back to the main section of the building anyway."
    },
    {
        "doorType": 2,
        "title":"Just in case",
        "shorttitle":"10",
        "contentmain":"Before leaving the east wing to head further in the direction of your next crew mate, Colin, you stop next to one of the cases with emergency vitality serums [health potion] and take out one syringe filled with bubbly green liquid. You can’t know what lies ahead. But you might as well come prepared.",
        "image":"item4.png",
        "image_width":"100px"
    },
    {
        "doorType": 4,
        "title":"Weak spot",
        "shorttitle":"11",
        "contentmain":"Moving further down the hallway as quickly as you can, you notice one of the smaller wall panels has a dent. And there is the green fungus slowly oozing out of it. So this could be how the fungus got in, interesting. You take a moment to examine the panel. Looks like someone could have just bumped against it. The outer mantle of the station is not in the best shape anymore, there could be all sorts of alien lifeforms trying to get in just waiting for a weak spot like that. "
    },
    {
        "doorType": 1,
        "title":"The Bottomless Bogs",
        "shorttitle":"12",
        "contentmain":"While looking closely at the dented panel, you almost don’t notice the turquoise bug-like creature crawling out of the green slime. With its six legs, it jumps at you and lands straight on your chest. You feel its teeth burying themselves in your skin.",
        "roll":"Dexterity saving throw", 
        "contentadditional1":"It’s hard for you to get a hold of the stupid thing before it attaches itself to you. You howl in pain, but can manage to get the thing off of you. The bug jumps back to the dent in the wall and disappears before you can catch it. -1d8 piercing damage",
        "contentadditional2":"It’s hard for you to get a hold of the stupid thing, it keeps crawling all over you and nibbles here and there. Eventually, you catch it before it drops to the ground, so you can quickly stomp it dead. -1d4 piercing damage",
        "contentadditional3":"Your reaction is quite quick. You end up catching it before it drops to the ground, so you can quickly stomp it dead.",
        "contentadditional4":"In one swift motion, you get it off of you and smash it on the wall. Between the slimy, sticky substance, the remains of the turquoise bug aren’t even that noticeable."
    },
    {
        "doorType": 3,
        "title":"Bitter coldness",
        "shorttitle":"13",
        "contentmain":"A battle takes place between you and the creature.",
        "contentadditional":"You got hurt, and the pain feels real. In the end, you destroy the ice elemental and it shatters into a million harmless pieces of ice [you gain one level]. As you sit down, exhausted, and watch the pile of ice for a few seconds, just in case it makes any unexpected movement, you discover a flower on a small heap just behind where you destroyed the ice elemental.",
        "image":"1.png",
        "contentadditionalTake":"I'm taking you with me!",
        "contentadditionalLeave":"Go to the capsules!"
    },
    {
        "doorType": 2,
        "title":"Ghost bloom flower",
        "shorttitle":"14",
        "contentmain":"You recognize the flower instantly. It’s the ghost bloom flower, the one Aluin told you about so many times. He said the Bottomless Bogs was the only place in the area where it grew and he needed it for his final project. This is why he left; because he wanted to get this flower. What did he tell you again exactly? If eaten raw, the flower would help make you stronger temporarily, and if cooked or brewed, it could be used as a potion of lesser invisibility. It could be helpful to you, so you put it in your backpack and continue on the same exact way you had figured out Aluin must have gone the first time you were here. You have the strong suspicion that whatever answers you search for must be hidden somewhere in a mountain cave.", 
        "image":"item14.jpg",
        "image_width":"18%"
    },
    {
        "doorType": 1,
        "title":"Mirror Lake",
        "shorttitle":"15",
        "contentmain":"You eventually leave the Bottomless Bogs without further complications and reach the frozen Mirror Lake. When you were here before, you remember asking yourself if you should take the shortest route and go straight over the frozen lake or rather hike around the lake through the forest.",
        "roll":"Nature ability check", 
        "contentadditional1":"Back then you thought the ice on the lake would definitely sustain you. Was this a good idea? Your memory seems to fade and usually you would take a second to reconsider and try to remember, but now the invisible force you already experienced so many times before makes you feel like a puppet. You have to cross this lake, just like you did before. Right at the center of the lake, the ice suddenly cracks. If you stand still now, the ice will eventually break and you will sink to the bottom of the lake with all your equipment. You start in a desperate sprint with all the ice plates you stepped on breaking right after you lift your feet from them. Luckily, you make it to the edge of the lake, but you’re out of breath and your coat got wet and is freezing. Reduce your CON stat by one.",
        "contentadditional2":"Back then you thought the ice on the lake would probably sustain you. You start out carefully, gradually putting your weight on the ice. It seems to hold and you continue step by step, listening for any noise of anything cracking. When you reach the middle of the lake, you know you have to be careful. This looks like the thinnest ice plate of the entire lake. Right at the center of the lake, the ice suddenly cracks. Your right foot sinks into the lake, but the rest of the ice plate remains intact. You reach the other side of the lake mostly dry.",
        "contentadditional3":"Back then you thought the ice on the lake would probably sustain you, at least the outer part of the ice ring. You avoid the center portion of the lake, since that looks way too thin to sustain you. You reach the other side of the lake completely dry.",
        "contentadditional4":"Back then you thought the ice on the lake would probably sustain you, at least the outer part of the ice ring. You avoid the center portion of the lake, since that one looks way too thin to sustain you. You reach the other side of the lake completely dry. Between the high grass you spot another ghost bloom flower, which you pluck and put into your backpack."
    },
    {
        "doorType": 2,
        "title":"The crystal ball",
        "shorttitle":"16",
        "contentmain":"As you move towards the Great Glacier and the Titan Peaks, you remember being unsure about where Aluin went exactly. You tracked him by following his distinct magical aura like a scent, but it became fainter and fainter the longer you tracked it. If you had anything that was bound to him, it would be much easier to follow the scent. You were thinking of various ways to solve this problem, as you suddenly bumped against something hard while stomping through the soft snow. You hit it again with your foot. It doesn’t seem to move, what was the thing you found here again? It’s on the tip of your tongue, but your memory is foggy. Remembering was of no use, so you crouch down into the snow and start digging. Eventually, you discover Aluin’s crystal ball. The one he always carried with him in his sorcerer bag, the one you lent him and eventually ended up giving him as a gift in the first year of the Academy. This would work perfectly as a tracking device and who knows, maybe it would even have some other practical use for you, it was a magic crystal ball after all! At the same time, you feel a growing sense of concern for Aluin. He would never leave his crystal behind, something terrible must have happened to him. You hope you aren’t coming too late.", 
        "image":"item16.jpg",
        "image_width":"13%"
    },
    {
        "doorType": 1,
        "title":"The hut",
        "shorttitle":"17",
        "contentmain":"You continue on over the Great Glacier. In the far distance, you can see the end of the glacier and the beginning of the Titan Peaks. Interestingly, you spot a small hut right on the edge of the glacier and the mountains. Aluin’s trail seems to lead in exactly that direction. Glacier witches… you mutter under your breath. This doesn’t look great for Aluin, and neither for you.",
        "roll":"History ability check", 
        "contentadditional1":"You have heard about the Glacier witches that live around here, but just rumours, like they had horns and hooves, and in general looked a lot like devils. These were just stories around town though, nobody had actually seen one such witch in person.",
        "contentadditional2":"You know something about Glacier witches since it came up in one of your Academy classes. They don’t form covenants, they prefer living alone and form a strong bond with the environment around them.",
        "contentadditional3":"You know something about Glacier witches since it came up in one of your Academy classes. They don’t form covenants, they prefer living alone and form a strong bond with the environment around them. They know exactly how to survive in the freezing cold and use each creature and plant around them to get exactly what they want. In general, they are known as ruthless and deceptive, not to be trusted since they always and exclusively look out for their own good.",
        "contentadditional4":"You know something about Glacier witches since it came up in one of your Academy classes. They don’t form covenants, they prefer living alone and form a strong bond with the environment around them. They know exactly how to survive in the freezing cold and use each creature and plant around them to get exactly what they want. In general, they are known as ruthless and deceptive, using lots of illusionary magic to get into their victim’s heads and weaken them. They are not to be trusted since they always and exclusively look out for their own good."
    },
    {
        "doorType": 2,
        "title":"Cottagecore",
        "shorttitle":"18",
        "contentmain":"Slowly and carefully, you approach the hut from the forest where you can hide behind some bushes. It is very possible that the witch had seen you before when you crossed the glacier, but maybe you are lucky, maybe she didn’t. You move a bit closer, as you can see light emitted from several candles inside the hut. Other than the flames of the candles, nothing moves inside. It is tempting, coming inside, it must be so warm, so comfortable, so nice you would never want to leave again. You do feel the cold now more than you ever had, your knees start shaking as you move towards the hut, and the warmth, and the pleasant smell and sound of a soup already starting to boil inside. Walking through what looked like a herb garden, you notice a beautiful sickle hanging from the fence, probably used to cut the herbs and grass in the area. Even though you want to enter the hut as quickly as possible, you still reach out and grab the sickle. Before you put it away into your coat, you notice an engraving on the sickle that said “Boginia”. If the witch is making soup, maybe she’ll need some freshly cut herbs for seasoning?", 
        "image":"item18.jpg",
        "image_width":"18%"
    },
    {
        "doorType": 1,
        "title":"Entering the witch’s den",
        "shorttitle":"19",
        "contentmain":"You open the door to the hut. Inside, you see the candles you already saw from outside, but while stepping in, you also see the ceiling, and about hundreds and hundreds of winter diamond flowers hanging from there. Some still have their sparkling ice blue color that reflects the candlelight, others are already dried and hang lifeless from the ceiling. In the back of the cabin, there is a creature looking like a human woman. Well, almost human. As she moves her right arm back and forth monotonously, you notice her dark blue skin on her boney arm. She is stirring a liquid inside a big black cauldron. You have surely been standing there for a couple of moments, but she still has to acknowledge your existence. You decide to talk first.",
        "roll":"Charisma saving throw", 
        "contentadditional1":"You take a few steps forward, put a weapon to the witch’s throat and say “I’m looking for someone … a friend. He was here before, tell me where he is now.”",
        "contentadditional2":"You take a few steps forward, put a weapon to the witch’s throat and say “I don’t want to hurt you. I’m looking for my friend Aluin, an elven sorcerer who is missing. He came here to your hut not long ago. Just tell me where he is now and I’ll be on my way.”",
        "contentadditional3":"You stay right where you are and say “Excuse me Ma’am, I’m looking for my friend Aluin, an elven sorcerer who is missing. I know he came here to your hut not long ago. Do you know where he is now? And don’t try any tricks on me, I know your kind.”",
        "contentadditional4":"You stay right where you are and say “Excuse me Ma’am, I’m looking for my friend Aluin, an elven sorcerer who is missing. I know he came here to your hut not long ago. Do you know where he is now? And don’t try any tricks on me, I know your kind. While I am very impressed by you and the wonders you can most likely conjure, I am not to be underestimated or toyed with.”"
    },
    {
        "doorType": 3,
        "title":"The Glacier witch",
        "shorttitle":"20",
        "contentmain":"A battle takes place between you and the witch.",
        "contentadditional":"The witch immediately starts to giggle, then cackle. “You human children always amuse me, you truly do.” She turns around, her silvery horns shining in the candlelight and her grimace sending shivers down your back. “I’ve been trying for years to get to you, my lovely marked one, and over the years, I got hold of everyone of my marked ones, except for you. And now, you are the one coming to me, unannounced, breaking into my home, and making demands. Enjoy your sleep. When you’ll wake up, you’ll be at the Court of the Prince and you’ll be his servant, for the rest of your life.” A big fight ensued, where you trashed her entire cottage, spilled her brew, got burned, frozen, paralysed and much more. In the end, you plunged your weapon through her heart and under her breath she muttered “The Receptacle, it will avenge me. You can’t save them, any of them.” before succumbing to her wounds [you gain one level]. Exhausted, but more determined than ever to find Aluin, you walk out of the cottage, with dark blue blood all over you.",
        "image":"1.png",
        "contentadditionalTake":"I'm taking you with me!",
        "contentadditionalLeave":"Go to the capsules!"
    },
    {
        "doorType": 1,
        "title":"Crystal Cave",
        "shorttitle":"21",
        "contentmain":"You walk past the herb garden and try to figure out where Aluin went from here. You know you were in this exact spot already, you walked through the herb garden, you had even fought the witch once before. However, every time you try to reach those memories, they fade out of your grasp. The best choice is still to move forward. Aluin’s trace picks up next to the hut and follows a mountain path. The path is quite rocky and everything is covered in snow, making it hard to hold on to anything or accurately identify where to place your feet next.",
        "roll":"Athletics ability check", 
        "contentadditional1":"When climbing up a steep portion of the trail, your left foot slips and you lose balance. You fall down a couple of meters. Roll 1d6 bludgeoning damage.",
        "contentadditional2":"When climbing up a steep portion of the trail, your left foot slips and you lose balance. You fall down a couple of meters. Luckily, you are not injured, but you fell right on your backpack.  Create a numbered list of all your items. Roll 1dx (x = amount of items). That item is now broken.",
        "contentadditional3":"You climb even the steeper portions of the trail easily. The exercise schedule at the Academy was tough, but you never skipped a single session.",
        "contentadditional4":"You climb even the steeper portions of the trail easily. In fact, it makes you eager for what’s coming next, to find and bring justice to whoever is responsible for the disappearance of Aluin. Your muscles are all warmed up now anyways. Add +1 to your strength modifier."
    },
    {
        "doorType": 1,
        "title":"Falling asleep… and waking up",
        "shorttitle":"22",
        "contentmain":"At the end of the path, you finally see it, the mountain cave. Looking so familiar, but yet so strange. You have no idea what is waiting for you inside. Whoever or whatever is in there, they better be afraid. The inside of the cave is full of icicles. Some hanging from the ceiling, others growing from the ground. There is a strange, ice blue glow coming from further inside the cave and you feel attracted to it, like a moth to the light. *Isn’t this where...wait!* You thought just before something hits you in the end and you lose consciousness. Now, it feels like you finally reached the end … of a movie, a memory, your life? No, you feel alive, you definitely feel alive. And awake. You feel like you are lying down and you feel the cold hardwood floor beneath you. No, that isn’t right, that was before, this is now, this is real. You open your eyes wide. You stare right at a wall of ice, and the wall stares back. Underneath you, you feel ice as well. Looking more closely at the wall of ice, you notice it is not one block of ice but rather made out of hundreds of little ice splinters. As you watch closely, you can see a faint reflection of a person in each of the splinters. Suddenly, the ice block moves and you notice that it is a huge humanoid giant made of ice. Certainly, it is three times your size. The creature stops moving and speaks with a voice coming from nowhere and anywhere at once. It sounds like a solemn choir of hundreds of voices, some old, some young, female voices and male voices: „You came. The Receptacle is looking forward to welcoming you inside of us. Please prepare to leave your body. If you resist, you will be killed.”",
        "roll":"Perception ability check", 
        "contentadditional1":"You try to concentrate on identifying the faces you saw in the splinters. You recognize one of them. It’s a girl from a farm close to your parent’s house, who disappeared in the Bogs around the time of the Snow Festival.",
        "contentadditional2":"You try to concentrate on identifying the faces you saw in the splinters. When you see Nic’s face, you freeze. It’s there for just a moment, then you can’t see him any more.",
        "contentadditional3":"You try to concentrate on identifying the faces you saw in the splinters. When you see Nic’s face, you freeze. He looks anxious, worried, but also highly concentrated.",
        "contentadditional4":"You try to concentrate on identifying the faces you saw in the splinters. When you see Nic’s face, you freeze. He looks anxious, worried, but also highly concentrated. His lips move and you hear a voice inside of your head “Don’t worry. We’ll destroy the Receptacle together. Then, we’ll all be free!”"
    },
    {
        "doorType": 2,
        "title":"Ice Gallery",
        "shorttitle":"23",
        "contentmain":"You jump up, ready to fight. There is no way in hell you are joining this monstrosity standing before you. Just as you were taught at the Academy, you scan your surroundings. You gasp at the vastness of the cave around you. In the walls, there are hundreds of smooth pieces of ice blocks emitting a faint ice blue light. Looking closer, you see each of those ice blocks has a creature enclosed inside. You see a lot of children, but also adults, elves, humans, dwarfs, all kinds of creatures. In one corner of the cave, you see what looks like a makeshift shelf and workbench. Sitting on the shelf, there are countless little glass figurines, all of different shapes, all with a small flame twirling inside them. Now, there is no more time to lose. You see your weapons placed next to the slab of ice you were just laying on and grab them.", 
        "image":"item2.png",
        "image_width":"18%"
    },
    {
        "doorType": 3,
        "title":"The Ice Monster of Many Faces",
        "shorttitle":"24",
        "contentmain":"A battle takes place between you and the ice monster",
        "contentadditional":"At first, you are somewhat hesitant to fight the monster. You see so many faces of people trapped inside it, you don’t want to risk hurting them. After a while, you start to notice some of the faces inside the ice splinters of the monster look exactly like some of the people trapped inside the ice blocks on the cave walls. Anyway, you have little choice, if you do not weaken the monster quickly, it will kill you, or worse. You don’t want to end up in an ice block. The fight is hard and drawn-out. It is as if the monster knows all the tricks of the witch and also the ice elementals and executes them perfectly. You think back to your training, do everything by the book and improvise here and there, until the ice monster is finally destroyed. With one clean swoop of your weapon, you slide into the monster, breaking it in half. There is an explosion of energy and for a second, all you can see is white light, and all you can hear is a buzzing coming from everywhere and nowhere at the same time.",
        "image":"1.png",
        "contentadditionalTake":"I'm taking you with me!",
        "contentadditionalLeave":"Go to the capsules!"
    },
    {
        "doorType": 2,
        "title":"Epilogue",
        "shorttitle":"25",
        "contentmain":"When you can finally see again, you see the monster, now just a chunk of ice, on the floor motionlessly. You look at the people in the ice blocks, and for a second, nothing moves and no sound is made. Suddenly, you hear glass break, once, twice, more and more, as the creatures inside the ice blocks wake up and punch through the thin layer of ice that separated them from the outside. You see hundreds of them looking drenched and wet, disoriented, probably not knowing where they are and what they are supposed to do. You, however, know exactly what to do. Moving swiftly through the crowd, you try to find the two people you care about most. You bump straight into a tall, gangly elf with big rounded glasses. For a second, he looks as confused as all the others, but then he recognizes you and you share the warmest hug you have ever shared. After you make sure Aluin is okay, relatively speaking, you continue your way through the crowd. You have to go far into the back of the tunneled cave to finally find him. He looks drenched, just like the other ones, but way less confused. Nic looks at you and you too share a warm hug. Moving swiftly through the crowd, you try to find the two people you care about most. You bump straight into a tall, gangly elf with big rounded glasses. For a second, he looks as confused as all the others, but then he recognizes you and you share the warmest hug you have ever shared. After you make sure Aluin is okay, relatively speaking, you continue your way through the crowd. You have to go far into the back of the tunneled cave to finally find him. He looks drenched, just like the other ones, but way less confused. Nic looks at you and you too share a warm hug. This is at least what she told us. It was quite weird, sharing your mind with so many other people. You do become very open-minded, literally speaking, since your thoughts are all shared inside the Receptacle. Over time, I also learned to control it, together with some friends I made inside there. I was sabotaging the witch where I could, resisting going to pick you up, leading her on false tracks so she wouldn’t be able to get to you.” You interjected “The winter diamonds. She said we were marked ones. She told our parents it would be a good omen to put the flower inside our cribs for good health, but it was a marker.” “Yes”, Nic replied “Never trust a Glacier witch is what they told you at the Academy, right? At least that’s what Aluin told me after the witch kidnapped him as well. Honestly, I was hoping you would come here someday and save us. I knew you could do it. In the meanwhile, I kept myself busy and learned a few magic tricks. The figurines for example, they are all mine. I got the ice elementals to place them on every porch that didn’t have a present on it yet on the day of the Snow Festival. I told them to put one on your porch as well. Oh and sorry for poking around in your memories earlier. During the first phase of attaching a soul to the Receptacle people typically relive random memories until they lose themselves in them, but I tried to guide you through the relevant memories tied to me, Aluin or the witch so you’d remember why you were here and that you needed to wake up.” You talk some more, until you notice the crowd of people growing concerned, some already starting to head out into the mountains on their own. “I think we need to get those people somewhere safe, Nic. We should get them all to Telos.” “Agreed, I’ll come with you, but I won’t stay long. I’m sure this Receptacle was not the only one out here. There must be more people trapped like me and I swore to myself if I ever did get out again, that I would find others in need and rescue them, just like I was rescued.” You look at Nic, with a body looking no more than 8 years old, but being a much older, braver soul than anyone could imagine. You escort the people back to Telos and spend the rest of your winter holidays managing operations at the newly founded Taskforce for Missing People at the Academy until every single person is brought back home and can be reunited with their loved ones. It was a truly magical holiday season.", 
        "image":"item2.png",
        "image_width":"18%"
    }

]